# -*- coding:utf-8 -*-

"""
希腊语
"""

ACCURATE_REGEX_LIST = []

SUB_TRANSLATE = [
    (r"Ιανουαρίου|Ιανουάριος|Ιαν", "1月"),
    (r"Φεβρουαρίου|Φεβρουάριος|Φεβ", "2月"),
    (r"Μαρτίου|Μάρτιος|Μαρ", "3月"),
    (r"Απριλίου|Απρίλιος|Απρ", "4月"),
    (r"Μαΐου|Μάιος|Μαΐ", "5月"),
    (r"Ιουνίου|Ιούνιος|Ιουν", "6月"),
    (r"Ιουλίου|Ιούλιος|Ιουλ", "7月"),
    (r"Αυγούστου|Αύγουστος|Αυγ", "8月"),
    (r"Σεπτεμβρίου|Σεπτέμβριος|Σεπτ", "9月"),
    (r"Οκτωβρίου|Οκτώβριος|Οκτ", "10月"),
    (r"Νοεμβρίου|Νοέμβριος|Νοε", "11月"),
    (r"Δεκεμβρίου|Δεκέμβριος|Δεκ", "12月"),
    (r"Δευτέρα|Δευτέρας", ""),
    (r"Τρίτη|Τρίτης", ""),
    (r"Τετάρτη|Τετάρτης", ""),
    (r"Πέμπτη|Πέμπτης", ""),
    (r"Παρασκευή|Παρασκευής", ""),
    (r"Σάββατο|Σαββάτου", ""),
    (r"Κυριακή|Κυριακής", ""),
    (r"(?P<num>\d+)\s*ώρες?\s*πριν", lambda m: "%s小时前" % int(m.group("num"))),
    (r"πριν από\s*(?P<num>\d+)\s*ώρες?", lambda m: "%s小时前" % int(m.group("num"))),
    (r"(?P<num>\d+)\s*λεπτά\s*πριν", lambda m: "%s分钟前" % int(m.group("num"))),
    (r"πριν από\s*(?P<num>\d+)\s*λεπτά", lambda m: "%s分钟前" % int(m.group("num"))),
    (r"(?P<num>\d+)\s*ημέρες?\s*πριν", lambda m: "%s天前" % int(m.group("num"))),
    (r"τώρα", "刚刚"),
    (r"σήμερα", "今天"),
    (r"χθες", "昨天"),
]

FUZZY_REGEX_LIST = []
