# -*- coding:utf-8 -*-

"""
希伯来语
"""

ACCURATE_REGEX_LIST = []

SUB_TRANSLATE = [
    (r"(?:יום\s+)?(?P<wd>ראשון|שני|שלישי|רביעי|חמישי|שישי)(?:\s+הבא)", lambda m: "下%s" % {
        "ראשון": "周日", "שני": "周一", "שלישי": "周二",
        "רביעי": "周三", "חמישי": "周四", "שישי": "周五"}[m.group("wd")]),
    (r"(?:יום\s+)?(?P<wd>ראשון|שני|שלישי|רביעי|חמישי|שישי)(?:\s+(?:שעבר|קודם))", lambda m: "上%s" % {
        "ראשון": "周日", "שני": "周一", "שלישי": "周二",
        "רביעי": "周三", "חמישי": "周四", "שישי": "周五"}[m.group("wd")]),
    (r"(?:יום\s+)?(?P<wd>ראשון|שני|שלישי|רביעי|חמישי|שישי)(?:\s+הזה)", lambda m: "这%s" % {
        "ראשון": "周日", "שני": "周一", "שלישי": "周二",
        "רביעי": "周三", "חמישי": "周四", "שישי": "周五"}[m.group("wd")]),
    (r"שבת\s+הבאה", "下周六"),
    (r"שבת\s+(?:שעברה|קודמת)", "上周六"),
    (r"שבת\s+הזאת", "这周六"),
    (r"(?:יום\s+)?(ראשון|שני|שלישי|רביעי|חמישי|שישי|שבת)",
     lambda m: "周%s" % {
         "ראשון": "日", "שני": "一", "שלישי": "二", "רביעי": "三",
         "חמישי": "四", "שישי": "五", "שבת": "六"}[m.group(1)]),
    (r"הבוקר", "今天 08:00 am"),
    (r"הצהריים|בצהריים", "12:00 pm"),
    (r"הערב", "今天 20:00 pm"),
    (r"מחר\s+בבוקר", "明天 08:00 am"),
    (r"מחר\s+בערב", "明天 20:00 pm"),
    (r"אתמול\s+בערב", "昨天 20:00 pm"),
    (r"חצות", "12:00 am"),
    (r"ב?ינואר", "1月"),
    (r"ב?פברואר", "2月"),
    (r"ב?מרץ", "3月"),
    (r"ב?אפריל", "4月"),
    (r"ב?מאי", "5月"),
    (r"ב?יוני", "6月"),
    (r"ב?יולי", "7月"),
    (r"ב?אוגוסט", "8月"),
    (r"ב?ספטמבר", "9月"),
    (r"ב?אוקטובר", "10月"),
    (r"ב?נובמבר", "11月"),
    (r"ב?דצמבר", "12月"),
    (r"יום שני", ""),
    (r"יום שלישי", ""),
    (r"יום רביעי", ""),
    (r"יום חמישי", ""),
    (r"יום שישי", ""),
    (r"שבת", ""),
    (r"ראשון", ""),
    (r"לפני\s*(?P<num>\d+)\s*שעות?", lambda m: "%s小时前" % int(m.group("num"))),
    (r"לפני\s*(?P<num>\d+)\s*דקות?", lambda m: "%s分钟前" % int(m.group("num"))),
    (r"לפני\s*(?P<num>\d+)\s*ימים?", lambda m: "%s天前" % int(m.group("num"))),
    (r"עכשיו", "刚刚"),
    (r"שלשום", "前天"),
    (r"מחרתיים", "后天"),
    (r"היום", "今天"),
    (r"אתמול", "昨天"),
    (r"מחר", "明天"),
    (r"בעוד\s+(?P<num>\d+)\s*(?P<unit>שניות?|דקות?|שעות?|ימים?|שבועות?|חודשים?|שנים?)",
     lambda m: "%s%s后" % (
         m.group("num"),
         {"שניה": "秒", "שניות": "秒", "דקה": "分钟", "דקות": "分钟",
          "שעה": "小时", "שעות": "小时", "יום": "天", "ימים": "天",
          "שבוע": "周", "שבועות": "周", "חודש": "月",
          "חודשים": "月", "שנה": "年", "שנים": "年"}[m.group("unit")])),
    (r"(?:בשבוע|השבוע)\s+הבא\b", "下周"),
    (r"(?:בשבוע|השבוע)\s+שעבר\b", "上周"),
    (r"(?:בחודש|החודש)\s+הבא\b", "下个月"),
    (r"(?:בחודש|החודש)\s+שעבר\b", "上个月"),
    (r"(?:בשנה|השנה)\s+הבאה\b", "明年"),
    (r"(?:בשנה|השנה)\s+שעברה\b", "去年"),
]

FUZZY_REGEX_LIST = []
