# -*- coding:utf-8 -*-

"""
希伯来语
"""

ACCURATE_REGEX_LIST = []

SUB_TRANSLATE = [
    (r"ב?ינואר", "1月"),
    (r"ב?פברואר", "2月"),
    (r"ב?מרץ", "3月"),
    (r"ב?אפריל", "4月"),
    (r"ב?מאי", "5月"),
    (r"ב?יוני", "6月"),
    (r"ב?יולי", "7月"),
    (r"ב?אוגוסט", "8月"),
    (r"ב?ספטמבר", "9月"),
    (r"ב?אוקטובר", "10月"),
    (r"ב?נובמבר", "11月"),
    (r"ב?דצמבר", "12月"),
    (r"יום שני", ""),
    (r"יום שלישי", ""),
    (r"יום רביעי", ""),
    (r"יום חמישי", ""),
    (r"יום שישי", ""),
    (r"שבת", ""),
    (r"ראשון", ""),
    (r"לפני\s*(?P<num>\d+)\s*שעות?", lambda m: "%s小时前" % int(m.group("num"))),
    (r"לפני\s*(?P<num>\d+)\s*דקות?", lambda m: "%s分钟前" % int(m.group("num"))),
    (r"לפני\s*(?P<num>\d+)\s*ימים?", lambda m: "%s天前" % int(m.group("num"))),
    (r"עכשיו", "刚刚"),
    (r"היום", "今天"),
    (r"אתמול", "昨天"),
]

FUZZY_REGEX_LIST = []
