# -*- coding:utf-8 -*-
# author: kusen
# email: 1194542196@qq.com
# date: 2023/5/16


"""
吉尔吉斯语
"""

ACCURATE_REGEX_LIST = [
    r"(?P<bH>\d+)\s*саат мурда",
]

SUB_TRANSLATE = [
    (r'Январь', '1月'),
    (r'Февраль', '2月'),
    (r'Март', '3月'),
    (r'Апрель', '4月'),
    (r'Май', '5月'),
    (r'Июнь', '6月'),
    (r'Июль', '7月'),
    (r'Август', '8月'),
    (r'Сентябрь', '9月'),
    (r'Октябрь', '10月'),
    (r'Ноябрь', '11月'),
    (r'Декабрь', '12月'),
    (r'кечээ', '昨天'),
    (r'бүгүн', '今天'),
    (r'эртең', '明天'),
    (r'азыр|деминде', '刚刚'),
    (r'(?P<num>\d+)\s*(?P<unit>сааттан|мүнөттөн|күндөн|жумадан|айдан|жылдан)\s+кийин',
     lambda m: "%s%s后" % (
         m.group("num"),
         {"сааттан": "小时", "мүнөттөн": "分钟", "күндөн": "天",
          "жумадан": "周", "айдан": "月", "жылдан": "年"}[
             m.group("unit")])),
    (r'(?P<num>\d+)\s*(?P<unit>саат|мүнөт|күн|жума|ай|жыл)\s+мурун',
     lambda m: "%s%s前" % (
         m.group("num"),
         {"саат": "小时", "мүнөт": "分钟", "күн": "天", "жума": "周",
          "ай": "月", "жыл": "年"}[m.group("unit")])),
    (r'кийинки\s+жума', '下周'),
    (r'өткөн\s+жума', '上周'),
    (r'кийинки\s+ай', '下个月'),
    (r'өткөн\s+ай', '上个月'),
    (r'кийинки\s+жыл', '明年'),
    (r'өткөн\s+жыл', '去年'),
]
FUZZY_REGEX_LIST = []
