# -*- coding:utf-8 -*-
# author: kusen
# email: 1194542196@qq.com
# date: 2023/5/16


"""
马拉地语
"""

ACCURATE_REGEX_LIST = [
    r"(?P<bH>\d+)\s*तासांपूर्वी",
    r"(?P<bM>\d+)\s*मिनिटांपूर्व",
]

SUB_TRANSLATE = [
    (r'एप्रिल', '4月'),
    (r'काल', '昨天'),
    (r'आज', '今天'),
    (r'उद्या', '明天'),
    (r'आत्ता|आत्ताच', '刚刚'),
    (r'(?P<num>\d+)\s*(?P<unit>तासांनंतर|मिनिटांनंतर|दिवसांनंतर|आठवड्यांनंतर|महिन्यांनंतर|वर्षांनंतर)',
     lambda m: "%s%s后" % (
         m.group("num"),
         {"तासांनंतर": "小时", "मिनिटांनंतर": "分钟",
          "दिवसांनंतर": "天", "आठवड्यांनंतर": "周",
          "महिन्यांनंतर": "月", "वर्षांनंतर": "年"}[
             m.group("unit")])),
    (r'(?P<num>\d+)\s*(?P<unit>दिवसांपूर्वी|आठवड्यांपूर्वी|महिन्यांपूर्वी|वर्षांपूर्वी)',
     lambda m: "%s%s前" % (
         m.group("num"),
         {"दिवसांपूर्वी": "天", "आठवड्यांपूर्वी": "周",
          "महिन्यांपूर्वी": "月", "वर्षांपूर्वी": "年"}[
             m.group("unit")])),
    (r'पुढील\s+आठवडा', '下周'),
    (r'मागील\s+आठवडा', '上周'),
    (r'पुढील\s+महिना', '下个月'),
    (r'मागील\s+महिना', '上个月'),
    (r'पुढील\s+वर्ष', '明年'),
    (r'मागील\s+वर्ष', '去年'),
]
FUZZY_REGEX_LIST = []
