# -*- coding:utf-8 -*-
# author: kusen
# email: 1194542196@qq.com
# date: 2023/5/16

"""
俄语
"""

ACCURATE_REGEX_LIST = [
    r"(?P<bS>\d+)\s*(?:секунд|секунда|секунды)\s*",
    r"(?P<bM>\d+)\s*(?:минут|минута|минуты)\s*",
    r"(?P<bH>\d+)\s*(?:час|часа|часов)\s*",
]

SUB_TRANSLATE = [
    (r"января|январь|янв\.?", "1月"),
    (r"февраля|февраль|фев\.?", "2月"),
    (r"марта|март|мар\.?", "3月"),
    (r"апреля|апрель|апр\.?", "4月"),
    (r"мая|май", "5月"),
    (r"июня|июнь|июн\.?", "6月"),
    (r"июля|июль|июл\.?", "7月"),
    (r"августа|август|авг\.?", "8月"),
    (r"сентября|сентябрь|сент\.?", "9月"),
    (r"октября|октябрь|окт\.?", "10月"),
    (r"ноября|ноябрь|нояб\.?", "11月"),
    (r"декабря|декабрь|дек\.?", "12月"),
    (r"сегодня\s*в\s*|сегодня", "今天"),
    (r"вчера\s*в\s*|вчера", "昨天"),
    (r"(?P<num>\d+)\s*(?:дней|дня|день)\s*назад", lambda m: "%s天前" % int(m.group("num"))),
    (r"(?P<num>\d+)\s*(?:недель|недели|неделю)\s*назад", lambda m: "%s周前" % int(m.group("num"))),
    (r"(?P<num>\d+)\s*(?:месяцев|месяца|месяц)\s*назад", lambda m: "%s月前" % int(m.group("num"))),
    (r"(?P<num>\d+)\s*(?:лет|года|год)\s*назад", lambda m: "%s年前" % int(m.group("num"))),
]
FUZZY_REGEX_LIST = []
