# -*- coding:utf-8 -*-
# author: kusen
# email: 1194542196@qq.com
# date: 2023/5/16

"""
僧伽罗语
"""

_SI_WEEKDAYS = {
    "සඳුදා": "周一",
    "අඟහරුවාදා": "周二",
    "බදාදා": "周三",
    "බ්‍රහස්පතින්දා": "周四",
    "සිකුරාදා": "周五",
    "සෙනසුරාදා": "周六",
    "ඉරිදා": "周日",
}
_SI_WEEKDAYS_RE = "|".join(sorted(_SI_WEEKDAYS, key=len, reverse=True))

ACCURATE_REGEX_LIST = [
]

SUB_TRANSLATE = [
    (r'ලබන\s+(%s)' % _SI_WEEKDAYS_RE,
     lambda m: "下%s" % _SI_WEEKDAYS[m.group(1)]),
    (r'පසුගිය\s+(%s)' % _SI_WEEKDAYS_RE,
     lambda m: "上%s" % _SI_WEEKDAYS[m.group(1)]),
    (r'මේ\s+(%s)' % _SI_WEEKDAYS_RE,
     lambda m: "这%s" % _SI_WEEKDAYS[m.group(1)]),
    (r'අද\s+උදෑසන', '今天 08:00 am'),
    (r'අද\s+උදේ(?:ට)?', '今天 08:00 am'),
    (r'අද\s+දවල්', '今天 12:00 pm'),
    (r'අද\s+පස්වරුවේ', '今天 15:00 pm'),
    (r'අද\s+සවස', '今天 20:00 pm'),
    (r'අද\s+රෑ', '今天 22:00 pm'),
    (r'හෙට\s+උදෑසන', '明天 08:00 am'),
    (r'ඊයේ\s+රෑ', '昨天 22:00 pm'),
    (r'මැදියම්\s+රෑ', '12:00 am'),
    (r'අප්‍රේල්', '4月'),
    (r'ජනවාරි', '1月'),
    (r'පෙබරවාරි', '2月'),
    (r'මාර්තු', '3月'),
    (r'මැයි', '5月'),
    (r'ජූනි', '6月'),
    (r'ජූලි', '7月'),
    (r'අගෝස්තු', '8月'),
    (r'සැප්තැම්බර්', '9月'),
    (r'ඔක්තෝබර්', '10月'),
    (r'නොවැම්බර්', '11月'),
    (r'දෙසැම්බර්', '12月'),
    (r'පෙරේදා', '前天'),
    (r'ඊයේ', '昨天'),
    (r'අද', '今天'),
    (r'හෙට', '明天'),
    (r'අනිද්දා', '后天'),
    (r'දැන්|මේ\s+දැන්', '刚刚'),
    (r'(?P<num>\d+)\s*(?P<unit>තත්පර|මිනිත්තු|පැය|දින|සති|මාස|වසර)\s+\d*\s*කින්',
     lambda m: "%s%s后" % (
         m.group("num"),
         {"තත්පර": "秒", "මිනිත්තු": "分钟", "පැය": "小时",
          "දින": "天", "සති": "周", "මාස": "月", "වසර": "年"}[
             m.group("unit")])),
    (r'(?P<unit>තත්පර|මිනිත්තු|පැය|දින|සති|මාස|වසර)\s+(?P<num>\d+)\s*කින්',
     lambda m: "%s%s后" % (
         m.group("num"),
         {"තත්පර": "秒", "මිනිත්තු": "分钟", "පැය": "小时",
          "දින": "天", "සති": "周", "මාස": "月", "වසර": "年"}[
             m.group("unit")])),
    (r'(?P<num>\d+)\s*(?P<unit>තත්පර|මිනිත්තු|පැය|දින|සති|මාස|වසර)\s+කට\s+පෙර',
     lambda m: "%s%s前" % (
         m.group("num"),
         {"තත්පර": "秒", "මිනිත්තු": "分钟", "පැය": "小时",
          "දින": "天", "සති": "周", "මාස": "月", "වසර": "年"}[
             m.group("unit")])),
    (r'(?P<unit>තත්පර|මිනිත්තු|පැය|දින|සති|මාස|වසර)\s+(?P<num>\d+)\s+කට\s+පෙර',
     lambda m: "%s%s前" % (
         m.group("num"),
         {"තත්පර": "秒", "මිනිත්තු": "分钟", "පැය": "小时",
          "දින": "天", "සති": "周", "මාස": "月", "වසර": "年"}[
             m.group("unit")])),
    (r'ලබන\s+සතිය', '下周'),
    (r'පසුගිය\s+සතිය', '上周'),
    (r'ලබන\s+මාසය', '下个月'),
    (r'පසුගිය\s+මාසය', '上个月'),
    (r'ලබන\s+වසර', '明年'),
    (r'පසුගිය\s+වසර', '去年'),
]

for _weekday in sorted(_SI_WEEKDAYS, key=len, reverse=True):
    SUB_TRANSLATE.append((_weekday, _SI_WEEKDAYS[_weekday]))

FUZZY_REGEX_LIST = [
]
