# -*- coding:utf-8 -*-
# author: kusen
# email: 1194542196@qq.com
# date: 2023/5/16

"""
僧伽罗语
"""

ACCURATE_REGEX_LIST = [
]

SUB_TRANSLATE = [
    (r'අප්‍රේල්', '4月'),
    (r'ජනවාරි', '1月'),
    (r'පෙබරවාරි', '2月'),
    (r'මාර්තු', '3月'),
    (r'මැයි', '5月'),
    (r'ජූනි', '6月'),
    (r'ජූලි', '7月'),
    (r'අගෝස්තු', '8月'),
    (r'සැප්තැම්බර්', '9月'),
    (r'ඔක්තෝබර්', '10月'),
    (r'නොවැම්බර්', '11月'),
    (r'දෙසැම්බර්', '12月'),
    (r'පෙරේදා', '前天'),
    (r'ඊයේ', '昨天'),
    (r'අද', '今天'),
    (r'හෙට', '明天'),
    (r'අනිද්දා', '后天'),
    (r'දැන්|මේ\s+දැන්', '刚刚'),
    (r'(?P<num>\d+)\s*(?P<unit>තත්පර|මිනිත්තු|පැය|දින|සති|මාස|වසර)\s+\d*\s*කින්',
     lambda m: "%s%s后" % (
         m.group("num"),
         {"තත්පර": "秒", "මිනිත්තු": "分钟", "පැය": "小时",
          "දින": "天", "සති": "周", "මාස": "月", "වසර": "年"}[
             m.group("unit")])),
    (r'(?P<unit>තත්පර|මිනිත්තු|පැය|දින|සති|මාස|වසර)\s+(?P<num>\d+)\s*කින්',
     lambda m: "%s%s后" % (
         m.group("num"),
         {"තත්පර": "秒", "මිනිත්තු": "分钟", "පැය": "小时",
          "දින": "天", "සති": "周", "මාස": "月", "වසර": "年"}[
             m.group("unit")])),
    (r'(?P<num>\d+)\s*(?P<unit>තත්පර|මිනිත්තු|පැය|දින|සති|මාස|වසර)\s+කට\s+පෙර',
     lambda m: "%s%s前" % (
         m.group("num"),
         {"තත්පර": "秒", "මිනිත්තු": "分钟", "පැය": "小时",
          "දින": "天", "සති": "周", "මාස": "月", "වසර": "年"}[
             m.group("unit")])),
    (r'(?P<unit>තත්පර|මිනිත්තු|පැය|දින|සති|මාස|වසර)\s+(?P<num>\d+)\s+කට\s+පෙර',
     lambda m: "%s%s前" % (
         m.group("num"),
         {"තත්පර": "秒", "මිනිත්තු": "分钟", "පැය": "小时",
          "දින": "天", "සති": "周", "මාස": "月", "වසර": "年"}[
             m.group("unit")])),
    (r'ලබන\s+සතිය', '下周'),
    (r'පසුගිය\s+සතිය', '上周'),
    (r'ලබන\s+මාසය', '下个月'),
    (r'පසුගිය\s+මාසය', '上个月'),
    (r'ලබන\s+වසර', '明年'),
    (r'පසුගිය\s+වසර', '去年'),
]

FUZZY_REGEX_LIST = [
]
