# -*- coding:utf-8 -*-
# author: kusen
# email: 1194542196@qq.com
# date: 2023/5/16

"""
塔吉克语
"""

ACCURATE_REGEX_LIST = [
]

SUB_TRANSLATE = [
    (r'январ', '1月'),
    (r'феврал', '2月'),
    (r'март', '3月'),
    (r'апрел', '4月'),
    (r'май', '5月'),
    (r'июн', '6月'),
    (r'июл', '7月'),
    (r'август', '8月'),
    (r'сентябр', '9月'),
    (r'октябр', '10月'),
    (r'ноябр', '11月'),
    (r'декабр', '12月'),
    (r'дирӯз', '昨天'),
    (r'имрӯз', '今天'),
    (r'фардо|пагоҳ', '明天'),
    (r'ҳоло|ҳамин\s+ҳоло', '刚刚'),
    (r'пас\s+аз\s+(?P<num>\d+)\s*(?P<unit>соат|дақиқа|рӯз|ҳафта|моҳ|сол)|(?P<num2>\d+)\s*(?P<unit2>соат|дақиқа|рӯз|ҳафта|моҳ|сол)\s+баъд',
     lambda m: "%s%s后" % (
         m.group("num") or m.group("num2"),
         {"соат": "小时", "дақиқа": "分钟", "рӯз": "天",
          "ҳафта": "周", "моҳ": "月", "сол": "年"}[
             m.group("unit") or m.group("unit2")])),
    (r'(?P<num>\d+)\s*(?P<unit>соат|рӯз|ҳафта|моҳ|сол)\s+пеш',
     lambda m: "%s%s前" % (
         m.group("num"),
         {"соат": "小时", "рӯз": "天", "ҳафта": "周",
          "моҳ": "月", "сол": "年"}[m.group("unit")])),
    (r'ҳафтаи\s+оянда', '下周'),
    (r'ҳафтаи\s+гузашта', '上周'),
    (r'моҳи\s+оянда', '下个月'),
    (r'моҳи\s+гузашта', '上个月'),
    (r'соли\s+оянда', '明年'),
    (r'соли\s+гузашта', '去年'),
]

FUZZY_REGEX_LIST = [
    r"(?P<bM>\d+)\s*дақиқалар\s*аввал",
]
