# -*- coding:utf-8 -*-
# author: kusen
# email: 1194542196@qq.com
# date: 2023/5/16

"""
乌克兰语
"""

ACCURATE_REGEX_LIST = [
]

SUB_TRANSLATE = [
    (r"Січень", "1月"),
    (r"Лютий", "2月"),
    (r"Березень", "3月"),
    (r'квітня|Квітень', '4月'),
    (r"Травень", "5月"),
    (r"Червень", "6月"),
    (r"Липень", "7月"),
    (r"Серпень", "8月"),
    (r"Вересень", "9月"),
    (r"Жовтень", "10月"),
    (r"Листопад", "11月"),
    (r"Грудень", "12月"),
    (r"післязавтра", "后天"),
    (r"позавчора", "前天"),
    (r"сьогодні", "今天"),
    (r"завтра", "明天"),
    (r"вчора", "昨天"),
    (r"зараз|щойно", "刚刚"),
    (r"через\s+(?P<num>\d+)\s*(?P<unit>секунд[иу]?|хвилин[иу]?|годин[иу]?|дні?|днів|тижн[іи]?|тижнів|місяц[і]?|місяців|рік|роки|років)",
     lambda m: "%s%s后" % (
         m.group("num"),
         {"секунда": "秒", "секунди": "秒", "секунду": "秒",
          "хвилина": "分钟", "хвилини": "分钟", "хвилину": "分钟",
          "година": "小时", "години": "小时", "годину": "小时",
          "день": "天", "дні": "天", "днів": "天",
          "тиждень": "周", "тижні": "周", "тижнів": "周",
          "місяць": "月", "місяці": "月", "місяців": "月",
          "рік": "年", "роки": "年", "років": "年"}[m.group("unit")])),
    (r"наступного? тижня\b|наступний тиждень\b", "下周"),
    (r"минулого? тижня\b|минулий тиждень\b", "上周"),
    (r"наступного? місяця\b|наступний місяць\b", "下个月"),
    (r"минулого? місяця\b|минулий місяць\b", "上个月"),
    (r"наступного? року\b|наступний рік\b", "明年"),
    (r"минулого? року\b|минулий рік\b", "去年"),
]

FUZZY_REGEX_LIST = [
    r"(?P<bH>\d+)\s*годин\(и\) тому",
    r"(?P<bH>\d+)\s*години\) тому",
    r"(?P<bH>\d+)\s*(?:годин|години|година)\s*тому",
    r"(?P<bM>\d+)\s*хвилин\(и\) тому",
    r"(?P<bM>\d+)\s*хвилини\) тому",
    r"(?P<bM>\d+)\s*(?:хвилин|хвилини|хвилина)\s*тому",
]
