# -*- coding:utf-8 -*-
# author: kusen
# email: 1194542196@qq.com
# date: 2023/5/16

"""
乌尔都语
"""

ACCURATE_REGEX_LIST = [
]

SUB_TRANSLATE = [
    (r'جنوری', '1月'),
    (r'فروری', '2月'),
    (r'مارچ', '3月'),
    (r'اپریل', '4月'),
    (r'مئی', '5月'),
    (r'جون', '6月'),
    (r'جولائی', '7月'),
    (r'اگست', '8月'),
    (r'ستمبر', '9月'),
    (r'اکتوبر', '10月'),
    (r'نومبر', '11月'),
    (r'دسمبر', '12月'),
    (r'گزشتہ\s+کل', '昨天'),
    (r'آج', '今天'),
    (r'کل', '明天'),
    (r'نرسوں', '前天'),
    (r'پرسوں', '后天'),
    (r'ابھی|اس\s+وقت', '刚刚'),
    (r'(?P<num>\d+)\s*(?P<unit>منٹ|گھنٹے|گھنٹہ|دن|ہفتے|مہینے|سال)\s+بعد',
     lambda m: "%s%s后" % (
         m.group("num"),
         {"منٹ": "分钟", "گھنٹے": "小时", "گھنٹہ": "小时",
          "دن": "天", "ہفتے": "周", "مہینے": "月", "سال": "年"}[
             m.group("unit")])),
    (r'(?P<num>\d+)\s*(?P<unit>گھنٹے|گھنٹہ|دن|ہفتے|مہینے|سال)\s+(?:قبل|پہلے)',
     lambda m: "%s%s前" % (
         m.group("num"),
         {"گھنٹے": "小时", "گھنٹہ": "小时", "دن": "天",
          "ہفتے": "周", "مہینے": "月", "سال": "年"}[m.group("unit")])),
    (r'اگلے\s+ہفتے', '下周'),
    (r'پچھلے\s+ہفتے', '上周'),
    (r'اگلے\s+مہینے', '下个月'),
    (r'پچھلے\s+مہینے', '上个月'),
    (r'اگلے\s+سال', '明年'),
    (r'پچھلے\s+سال', '去年'),
]

FUZZY_REGEX_LIST = [
    r"(?P<bM>\d+)\s*منٹ قبل"
]
