# -*- coding:utf-8 -*-
# author: kusen
# email: 1194542196@qq.com
# date: 2023/5/16

"""
中文
"""

ACCURATE_REGEX_LIST = [

]

SUB_TRANSLATE = [
    (r"十一", "11"),
    (r"十二", "12"),
    (r"十三", "13"),
    (r"十四", "14"),
    (r"十五", "15"),
    (r"十六", "16"),
    (r"十七", "17"),
    (r"十八", "18"),
    (r"十九", "19"),
    (r"二十一", "21"),
    (r"二十二", "22"),
    (r"二十三", "23"),
    (r"二十四", "24"),
    (r"二十", "20"),
    (r"十", "10"),
    (r"一", "1"),
    (r"二", "2"),
    (r"三", "3"),
    (r"四", "4"),
    (r"五", "5"),
    (r"六", "6"),
    (r"七", "7"),
    (r"八", "8"),
    (r"九", "9"),
    (r"零", "0"),
    (r"上午", "am"),
    (r"下午", "pm"),
]
FUZZY_REGEX_LIST = []