# -*- coding:utf-8 -*-
# author: kusen
# email: 1194542196@qq.com
# date: 2023/5/16

"""
中文
"""

ACCURATE_REGEX_LIST = [

]

SUB_TRANSLATE = [
    (r"壹", "1"),
    (r"貳|贰|两|兩", "2"),
    (r"參|叁|参", "3"),
    (r"肆", "4"),
    (r"伍", "5"),
    (r"陸|陆", "6"),
    (r"柒", "7"),
    (r"捌", "8"),
    (r"玖", "9"),
    (r"拾", "10"),
    (r"〇|○", "0"),
    (r"點", "点"),
    (r"十一", "11"),
    (r"十二", "12"),
    (r"十三", "13"),
    (r"十四", "14"),
    (r"十五", "15"),
    (r"十六", "16"),
    (r"十七", "17"),
    (r"十八", "18"),
    (r"十九", "19"),
    (r"二十一", "21"),
    (r"二十二", "22"),
    (r"二十三", "23"),
    (r"二十四", "24"),
    (r"二十", "20"),
    (r"十", "10"),
    (r"一", "1"),
    (r"二", "2"),
    (r"三", "3"),
    (r"四", "4"),
    (r"五", "5"),
    (r"六", "6"),
    (r"七", "7"),
    (r"八", "8"),
    (r"九", "9"),
    (r"零", "0"),
    (r"(?P<H>\d{1,2})\s*点半", lambda m: "%d:30" % int(m.group("H"))),
    (r"(?P<H>\d{1,2})\s*点\s*(?:(?P<M>\d{1,2})\s*分?)?",
     lambda m: "%d:%02d" % (int(m.group("H")), int(m.group("M") or 0))),
    (r"\s*(?P<apm>am|pm)(?P<time>\d{1,2}:\d{2}(?::\d{2})?)",
     lambda m: "%s %s" % (m.group("time"), m.group("apm"))),
    (r"凌晨|清晨|早上|早晨", " am"),
    (r"中午", " pm"),
    (r"下午|傍晚|晚上|夜里|夜间|深夜", " pm"),
    (r"午夜|半夜", "12:00 am"),
    (r"上午", " am"),
    (r"下午", " pm"),
]
FUZZY_REGEX_LIST = []
